<template>
  <section class="lead" id="contact">
    <div class="container">
      <div class="row">
        <div class="col-lg-12 mx-auto">
          <h2>ติดต่อ-สอบถาม</h2>
        </div>
        <div class="col-lg-8 mt-2">
          <h3>
            มีข้อสงสัย?
          </h3>
          <p>
            ลองอ่านข้อมูลในคำถามที่พบบ่อยดูก่อน
          </p>
        </div>
        <div class="col-lg-4 mt-2 text-right">
          <h2 class="font-weight-bold">
            <a href="#" data-toggle="modal" data-target="#faqModal">
              FAQ <i class="fas fa-file-alt"></i>
            </a>
          </h2>

          <!-- Modal -->
          <div class="modal fade" id="faqModal" tabindex="-1" role="dialog" aria-labelledby="faqModalLabel" aria-hidden="true">
            <div class="modal-dialog modal-lg" role="document">
              <div class="modal-content">
                <div class="modal-header">
                  <h5 class="modal-title" id="faqModalLabel">คำถามที่พบบ่อย</h5>
                  <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                    <span aria-hidden="true">&times;</span>
                  </button>
                </div>
                <div class="modal-body lead text-justify">
                  <h2 class="mt-5">
                    หมวดสถาบันและหลักสูตรการเรียน 
                  </h2>
                  <h4>
                    VISTEC คือมหาวิทยาลัยเกี่ยวกับอะไร คณะผู้สอนคือใคร 
                  </h4>
                  <p>
                    สถาบันวิทยสิริเมธี (VISTEC) เป็นสถาบันที่มุ่งเน้นผลิตงานวิจัยและสร้างบุคลากรวิจัยทางด้านวิทยาศาตร์และเทคโนโลยี ปัจจุบันเปิดสอนในระดับปริญญาโทและเอก ใน 4 สาขาวิชา รวมถึงสาขา Information Science and Technology ด้วย 
                  </p>
                  <p>
                    อาจารย์จะเป็นผู้เชี่ยวชาญในวงการ data science ของเมืองไทย ทั้งจากมหาวิทยาลัยและภาคเอกชน 
                  </p>
                  <h4>
                    หลักสูตร Data Science and Engineering Program เป็นหลักสูตรที่เกี่ยวกับอะไร 
                  </h4>
                  <p>
                    หลักสูตรเพื่อพัฒนาบุคลากรด้าน Data Science ให้กับกลุ่มปตท.อย่างครบวงจร โดยในปีแรกจะมุ่งเน้นไปที่การปูพื้นฐาน Data Science เบื้องต้น เพื่อให้ผู้เข้าอบรมสามารถนำข้อมูลที่มีอยู่มาใช้ในการทำงานได้มีประสิทธิภาพมากขึ้น เช่น การสร้างแบบจำลองแบบง่ายๆ ได้ 
                  </p>
                  <h4>
                    หลักสูตรที่เรียนเป็นหลักสูตรเฉพาะสำหรับกลุ่มปตท. จะแตกต่างกับหลักสูตรปกติอย่างไร 
                  </h4>
                  <p>
                    หลักสูตรนี้ได้ถูกออกแบบมาให้เหมาะสมกับการทำงานของพนักงานส่วนใหญ่ของปตท. ซึ่งมีพื้นฐานทางด้านวิศวกรรม แต่ในขณะเดียวกันก็มีคอร์สปูพื้นฐาน สำหรับพนักงานในสายอื่น หรือพนักงานที่ต้องการทบทวนความรู้พื้นฐานเช่นกัน 
                  </p>
                  <p>
                    ตัวอย่างที่ใช้ในการเรียนการสอนส่วนหนึ่งจะเป็นตัวอย่างจากบริษัทในเครือปตท. และผู้เข้าอบรมจะได้ลงมือทำโปรเจ็กต์เพื่อตอบโจทย์การทำงานของบริษัทของตัวเอง 
                  </p>
                  <h4>
                    หากลงเรียนหลักสูตรนี้จะได้เรียนรู้อะไรบ้าง และจะนำมาปรับใช้ในการทำงานได้อย่างไรบ้าง 
                  </h4>
                  <p>
                    ผู้เข้าอบรมจะได้เรียนรู้ทักษะพื้นฐานสำหรับ Data Science คือ พื้นฐานคณิตศาสตร์ สถิติ การเขียนโปรแกรมเบื้องต้น รวมไปถึงการใช้ฐานข้อมูลเบื้องต้น และสามารถเลือกเรียนสาขาเฉพาะเพิ่มเติมได้ดังนี้ 
                  </p>
                  <div class="table-responsive-md text-left">
                    <table class="table table-sm">
                      <thead class="font-weight-bold"><tr><th>Track</th><th>ทักษะที่จะได้เรียนรู้</th><th>ตัวอย่างตำแหน่งงาน</th></tr></thead>
                      <tbody>
                        <tr>
                          <th scope="row">ML/AI and Data Mining</th>
                          <td>ใช้ Machine Learning และ Artificial Intelligence ในการแก้ปัญหาทางธุรกิจ</td>
                          <td>Data Scientist, ML/AI Solution Provider</td>
                        </tr>
                        <tr>
                          <th scope="row">Data Engineering</th>
                          <td>สร้าง และดูแลระบบข้อมูล และช่วย support ข้อมูลให้แก่บุคลากรด้าน Data Science ในแขนงอื่น ๆ</td>
                          <td>Data Storage and Extraction Manager</td>
                        </tr>
                        <tr>
                          <th scope="row">Visual Analytics and HCI</th>
                          <td>นำเสนอข้อมูลในรูปแบบต่างๆ รวมถึงการสร้างเครื่องมือด้านข้อมูลให้แก่บุคคลทั่วไป</td>
                          <td>User Interface (UI) and User Experience (UX) Expert</td>
                        </tr>
                        <tr>
                          <th scope="row">Business Analytics</th>
                          <td>เปลี่ยนข้อมูลให้เป็น business insight และกลยุทธ์ทางธุรกิจ และนำสิ่งเหล่านี้ไปใช้พัฒนาการประกอบธุรกิจ</td>
                          <td>Business Analytics Solution Provider</td>
                        </tr>
                      </tbody>
                    </table>
                    <h4>
                      เรียนจบแล้วได้รับใบประกาศ / วุฒิบัตรจาก VISTEC หรือไม่ 
                    </h4>
                    <p>
                      หลักสูตรนี้ไม่มีใบประกาศหรือวุฒิบัตรให้ แต่สำหรับพนักงาน GC จะได้รับการบันทึกในประวัติว่าเคยผ่านการเรียนหลักสูตรนี้ เพื่อประโยชน์ในการ Rotate หรือ ปรับระดับในอนาคต และสำหรับพนักงานในกลุ่มปตท. ทาง VISTEC จะแจ้งผลการอบรมกลับไปที่บริษัทต้นสังกัดเพื่อบันทึกประวัติ ทั้งนี้จะขึ้นอยู่กับนโยบายของบริษัทต้นสังกัดด้วย   
                    </p>

                    <h2 class="mt-5">
                      หมวดการเตรียมตัว
                    </h2>
                    <h4>
                      ต้องมีความรู้พื้นฐานอะไรบ้าง มีการสอบเพื่อวัดพื้นฐานหรือไม่ 
                    </h4>
                    <p>
                      หลักสูตรไม่ได้กำหนดความรู้พื้นฐานอย่างตายตัว ผู้เข้าอบรมที่มีพื้นฐานทางคณิตศาสตร์ สถิติ และการเขียนโปรแกรม อาจจะสามารถเรียนรู้ได้เร็วกว่าผู้เข้าอบรมที่ไม่มีพื้นฐานดังกล่าว ทั้งนี้ จะมีการสอบวัดพื้นฐานเพื่อจัดผู้เข้าอบรมให้เข้าเรียนตามระดับที่เหมาะสม 
                    </p>
                      
                    <h4>
                      ระยะเวลาเรียนประมาณกี่เดือน เรียนวันไหน และเรียนที่ไหน 
                    </h4>
                    <h5>
                      ระยะเวลาเรียน 
                    </h5>
                    <p>
                      ระยะเวลาเรียนตลอดหลักสูตร ตั้งแต่ Level 0 ถึง Level 1.3 ใช้เวลาประมาณ 10 เดือน โดย Level 0 ใช้เวลา 1 วัน, Level 1.1- 1.3 ใช้เวลา Level ละ 3 เดือน  
                    </p>
                    <h5>
                      เรียนวันไหน  
                    </h5>
                    <p>
                      ในแต่ละ Level จะเรียนเฉลี่ยสัปดาห์ละ 1 วัน โดยแบ่งเป็น Intensive class 4-5 ครั้ง Clinic สำหรับให้คำปรึกษาการเรียนหรือการทำโปรเจ็ค 3-4 ครั้ง ดูงานนอกสถานที่ 1-2 ครั้ง และเวลาที่เหลือสำหรับให้ผู้เรียนทำโปรเจ็คต์ 
                    </p>
                    <p>
                      <span class="font-weight-bold">หมายเหตุ&colon;</span> จะนัดหมายวันและเวลาเรียนอีกครั้ง
                    </p>
                    <h5>
                      เรียนที่ไหน 
                    </h5>
                    <p>
                      การเรียนการสอนส่วนใหญ่จะจัดที่ GC Rayong office และมีการจัดการเรียนการสอน หรือการดูงานนอกสถานที่บ้าง ไม่เกิน Level ละ 2 ครั้ง  
                    </p>

                    <h4>
                      ถ้าสนใจสมัครได้เลยหรือไม่ ต้องขออนุมัติจากผู้บังคับบัญชาหรือไม่ 
                    </h4>
                    <p>
                      เหมือนกับการเข้าหลักสูตรฝึกอบรมอื่นๆ จำเป็นต้องได้รับอนุญาตจากผู้บังคับบัญชาก่อน โดยพนักงานที่สนใจต้องได้รับอนุมัติจาก Supervisor ของท่านเป็นลายลักษณ์อักษรผ่านอีเมล์หรือเอกสารอื่นๆ และแนบใบอนุมัตินี้มากับ online application form ด้วย   
                    </p>
                    <h4>
                      หลักสูตรนี้ใครสามารถสมัครได้บ้าง และสมัครแล้วจะได้เรียนทุกคนหรือไม่ 
                    </h4>
                    <p>
                      พนักงานระดับ Division Manager ลงมา สามารถสมัครได้ แต่เนื่องจากมีโควต้าจำกัด จึงจำเป็นต้องมีการคัดเลือกพนักงานเพียง 100 คน เพื่อให้การเรียนการสอนมีประสิทธิภาพสูงสุด 
                    </p>
                    
                    <h4>
                      มีค่าใช้จ่ายหรือไม่ ใครจะเป็นผู้รับผิดชอบค่าใช้จ่าย  
                    </h4>
                    <p>
                      ค่าหลักสูตรเฉลี่ย 110,000 บาทต่อคน  
                    </p>
                    <p>
                      สำหรับพนักงานในกลุ่ม GC บริษัท GC จะเป็นผู้ออกค่าหลักสูตรให้ สำหรับพนักงานในกลุ่ม ปตท. อื่นๆ ทาง GC จะเรียกเก็บค่าหลักสูตรจากต้นสังกัดตามเงื่อนไขที่ตกลงกัน 
                    </p>
                    <p>
                      ทั้งนี้ ค่าใช้จ่ายอื่นๆ นอกเหนือจากที่เตรียมให้ เช่น ค่าเดินทาง ค่าอาหาร ค่าอุปกรณ์ที่ใช้ในการเรียน ค่าที่พัก เป็นต้น ต้นสังกัดของพนักงานหรือพนักงานจะต้องรับผิดชอบค่าใช้จ่ายเอง ซึ่งค่าใช้จ่ายอื่น ๆ หลังจากผ่านการอบรมเจ้าหน้าที่จะแจ้งให้ทราบอีกครั้ง  
                    </p>

                    <h2 class="mt-5">
                      หมวคคำถามทั่วไป 
                    </h2>
                    <h4>
                      หากต้องเดินทางไปที่ VISTEC จะมีรถรับส่งหรือไม่  
                    </h4>
                    <p>
                      หากต้องเดินทางไปเรียนที่ VISTEC จะมีรถตู้รับ-ส่งระหว่าง GC Rayong Office และ VISTEC  
                    </p>
                      
                    <h4>
                      มีหลักสูตรเรียนออนไลน์หรือไม่ 
                    </h4>
                    <p>
                      ทางทีมงานจะบันทึกวิดีโอการเรียนการสอน ผู้อบรมและพนักงานสามารถเข้าไปให้ดูย้อนหลังได้ที่เวปไซต์ www.dexsparkprogram.com  
                    </p>
                    
                    <h4>
                      แผนที่ VISTEC / RO / ENCO (ถ้ามีเรียนที่ ENCO) 
                    </h4>
                    <p>
                      <span class="font-weight-bold">VISTEC:</span> <a href="https://goo.gl/maps/mCaPbcqBZUJ2" target="_blank">เปิดด้วย Google Maps <i class="fas fa-external-link-alt"></i></a> <br>
                      <span class="font-weight-bold">RO:</span> <a href="https://goo.gl/maps/1SJAs31VWCv" target="_blank">เปิดด้วย Google Maps <i class="fas fa-external-link-alt"></i></a> <br>
                      <span class="font-weight-bold">ENCO:</span> <a href="https://goo.gl/maps/kPy26aHvfLH2" target="_blank">เปิดด้วย Google Maps <i class="fas fa-external-link-alt"></i></a> 
                    </p>
                    
                    <h4>
                      หากต้องการข้อมูลเพิ่มเติมสามารถสอบถามข้อมูลได้อย่างไร 
                    </h4>
                    <p>
                      ศึกษาข้อมูลเพิ่มเติมได้ที่ <br>
                      <span class="font-weight-bold">Website:</span> <a href="http://www.dexsparkprogram.pttgcgroup.com" target="_blank">www.dexsparkprogram.pttgcgroup.com <i class="fas fa-external-link-alt"></i></a> <br>
                      <span class="font-weight-bold">Line ID:</span> <a href="http://line.me/ti/p/@dEXInfo" target="_blank">@dexinfo <i class="fas fa-external-link-alt"></i></a> <br>
                      <span class="font-weight-bold">Email:</span> <a href="mailto:dexperience@pttgcgroup.com">dexperience@pttgcgroup.com <i class="fas fa-envelope-square"></i></a>
                    </p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div class="col-lg-8 mt-2">
          <h3>
            ยังไม่พบคำตอบ?
          </h3>
          <p>
            นี่คือแหล่งรวบรวมคำตอบสำหรับคำถามอื่นๆ ที่เราได้รับ ลองค้นหาคำตอบของคุณดูในนี้สิ
          </p>
        </div>
        <div class="col-lg-4 mt-2 text-right">
          <h2 class="font-weight-bold">
            <a href="#" data-toggle="modal" data-target="#qaModal">
              Q&amp;A List <i class="fas fa-file-alt"></i>
            </a>
          </h2>
          
          <!-- Modal -->
          <div class="modal fade" id="qaModal" tabindex="-1" role="dialog" aria-labelledby="qaModalLabel" aria-hidden="true">
            <div class="modal-dialog modal-lg" role="document">
              <div class="modal-content">
                <div class="modal-header">
                  <h5 class="modal-title" id="qaModalLabel">คำถามอื่นๆ</h5>
                  <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                    <span aria-hidden="true">&times;</span>
                  </button>
                </div>
                <div class="modal-body lead text-justify">
                  <div class="container-fluid my-5" v-for="section in qaList" v-bind:key="section.id" v-bind:id="section.id">
                    <div class="row">
                      <div class="col-md-12">
                        <h2 v-html="section.headingHtml"></h2>
                      </div>
                    </div>
                    <div class="row" v-for="question in section.questions" v-bind:key="question.id" v-bind:id="question.id">
                      <div class="col-md-11 my-auto">
                        <h4 v-html="question.questionHtml"></h4>
                      </div>
                      <div class="col-md-1 my-auto text-right">
                        <h4 class="font-weight-bold">
                          <a v-bind:href="'#collapse-' + question.id" v-bind:aria-controls="'collapse-' + question.id" aria-expanded="false" data-toggle="collapse">
                            <i class="far fa-eye"></i>
                          </a>
                        </h4>
                      </div>
                      <div class="col-md-12">
                        <div class="collapse" v-bind:id="'collapse-' + question.id">
                          <div v-html="question.answerHtml"></div>
                        </div>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div class="col-lg-8 mt-2">
          <h3>
            ช่องทางการติดต่อ
          </h3>
          <p>
            หากยังไม่พบคำตอบ สามารถติดต่อสอบถามข้อมูลเพิ่มเติมได้ที่
          </p>
        </div>
        <div class="col-lg-4 mt-2 text-right">
          <h2 class="font-weight-bold">
            <a href="http://line.me/ti/p/@dEXInfo" target="_blank">
              @dEXInfo <i class="fab fa-line"></i>
            </a>
          </h2>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import uuidv4 from 'uuid/v4'
export default {
  data () {
    return {
      qaList: [
        {
          id: uuidv4(),
          headingHtml: 'หมวดคำถามเกี่ยวกับ Data Science',
          questions: [
            {
              id: uuidv4(),
              questionHtml: 'ขอยกตัวอย่าง Use Case ในธุรกิจ Polymer',
              answerHtml: 'ได้มีการนำข้อมูลมาช่วยลดระยะเวลาและต้นทุนที่ใช้ในการคิดค้นวัสดุใหม่ๆ (Materials Informatics)'
            },
            {
              id: uuidv4(),
              questionHtml: 'คิดว่าโครงการที่จัดตั้งขึ้นมาควรที่จะเรียนแล้วพัฒนาโปรเจคขึ้นมาเองหรือว่าควรจะหาที่ปรึกษาภายนอกเข้ามาแล้วร่วมกันสร้างโปรเจคขึ้นมาแล้วจะได้ประสิทธิภาพมากกว่ากัน',
              answerHtml: 'อยากจะให้เน้นไปที่การทดลองทำเอง เพื่อให้เข้าใจกระบวนการทำงานอย่างลึกซึ้งค่ะ ทำเองอาจจะไม่ได้เร็ว หรือดีที่สุด แต่จะช่วยให้เราเรียนรู้ได้อย่างแท้จริง'
            },
            {
              id: uuidv4(),
              questionHtml: 'อยากให้ยกตัวอย่างงานที่ใช้ Data Science มาช่วยในการทำงานในโรงงานปิโตรเคมีแบบ GC',
              answerHtml: 'IRPC ได้มีการนำ Data Science มา Optimize กำไรในระดับ Plant ค่ะ'
            },
            {
              id: uuidv4(),
              questionHtml: 'ช่วยยกตัวอย่าง การสร้างผลิตภัณฑ์หรือฟีเจอร์ใหม่จากข้อมูล (Data Products) ครับ',
              answerHtml: 'ผู้ให้บริการโทรศัพท์มือถือหลายรายทั่วโลก เริ่มนำข้อมูลของลูกค้ามาวิเคราะห์ เพื่อขายให้กับบริษัทอื่นๆ ที่สนใจ'
            },
            {
              id: uuidv4(),
              questionHtml: 'ช่วยสรุปสิ่งที่ ผู้เข้าร่วมจะสามารถทำได้ หลังจากจบการเรียนครับ อย่างเช่น สามารถทำ Machine Learning เพื่อ Predict Failure ของเครื่องจักรได้หรือไม่',
              answerHtml: 'ผู้เรียนทุกคนจะมีทักษะพื้นฐานคือคณิตศาสตร์ สถิติ การเขียนโปรแกรมเบื้องต้น และจะมีทักษะตามสาขาที่เลือกเรียน ถ้าเลือกเรียน Machine Learning ก็จะมีความรู้ด้านการทำ Prediction ขั้นพื้นฐาน'
            },
            {
              id: uuidv4(),
              questionHtml: 'คิดว่าโครงการที่จัดตั้งขึ้นมาควรที่จะเรียนแล้วพัฒนาโปรเจคขึ้นมาเองหรือว่าควรจะหาที่ปรึกษาภายนอกเข้ามาแล้วร่วมกันสร้างโปรเจคขึ้นมาแล้วจะได้ประสิทธิภาพมากกว่ากัน',
              answerHtml: 'อยากจะให้เน้นไปที่การทดลองทำเอง เพื่อให้เข้าใจกระบวนการทำงานอย่างลึกซึ้งค่ะ ทำเองอาจจะไม่ได้เร็ว หรือดีที่สุด แต่จะช่วยให้เราเรียนรู้ได้อย่างแท้จริง'
            },
            {
              id: uuidv4(),
              questionHtml: 'มี Use Case ตัวอย่างในการทำ Strategy ของบริษัทในระดับ Corporate หรือไม่ เช่นการทำแผนธุรกิจ, การวิเคราะห์ธุรกิจในภาพรวม, อื่นๆ',
              answerHtml: 'ตัวอย่างเช่นการทำ Planning แต่ก่อนอาจจะใช้วิธีขอให้แต่ละหน่วยงานส่งความต้องการของตนมาที่ส่วนกลาง แต่ Data Science สามารถช่วยให้ส่วนกลางสามารถ Predict ความต้องการเหล่านี้ได้ และสามารถทำ Planning ได้แม่นยำมากขึ้นโดยใช้เวลาน้อยลง'
            },
            {
              id: uuidv4(),
              questionHtml: 'Project ที่จะนำเสนอเข้าไปในคอร์ส จะถูก Study ในคอร์สไหมครับ แล้วจำเป็นต้องจบ Project พร้อมคอร์สเรียนไหมครับ ถ้าจบไม่ทันจะมี Follow Up กันยังไงครับ',
              answerHtml: 'Project จะทำควบคู่ไปกับการเรียน แต่จะไม่ใช่การนำไปใช้ในห้องเรียนจริงๆ ผู้เรียนจะต้องสรุปจบ Project พร้อมกับหลักสูตรค่ะ'
            },
            {
              id: uuidv4(),
              questionHtml: 'อยากให้อาจารย์เล่าให้ฟังถึงความสำคัญของ Data Science ในอุตสาหกรรมปิโตรเคมี และคิดเห็นอย่างไรกับความก้าวหน้าของผู้ที่เข้ามาเรียนว่าทิศทางจะไปต่ออย่างไรหากจบโครงการไปแล้ว',
              answerHtml: 'ผู้ที่เรียนจบแล้วสามารถทำงานแบบเดิม แต่สามารถนำ Data Science ไปพัฒนาการทำงานให้ดีขึ้นได้ หรือถ้าสนใจ Data Science เป็นอย่างมาก ก็อาจจะเลือกเป็น Data Scientist ให้กับบริษัท'
            },
            {
              id: uuidv4(),
              questionHtml: 'รู้ได้อย่างไรว่า Data ไหนมีประโยชน์ สร้าง ประโยชน์ได้',
              answerHtml: 'ขึ้นอยู่กับโจทย์ การตีความและนำไปใช้ค่ะ'
            },
            {
              id: uuidv4(),
              questionHtml: 'การทำ Project Data Science สิ่งที่สำคัญคือข้อมูลที่มีคุณภาพ ถ้าหากข้อมูลที่โรงงานมีไม่ครบหรือคุณภาพไม่ดีจะสามารถทำโปรเจคได้มั้ยคะ',
              answerHtml: 'เราจะต้องนำข้อมูลมา Clean ก่อนนำไปใช้อยู่แล้วค่ะ ขั้นตอนนี้จะช่วยคัดกรองข้อมูลได้ในระดับนึง แต่ถ้าข้อมูลมีจำนวนน้อยมาก หรือคุณภาพแย่มาก ก็อาจจะไม่สามารถนำมาใช้ได้ เช่น ถ้าทั้งโรงงานมีเครื่องจักร 10 ตัว แต่เรามีข้อมูลที่ใช้ได้แค่ตัวเดียว'
            }
          ]
        },
        {
          id: uuidv4(),
          headingHtml: 'หมวดคำถามเกี่ยวกับสถาบัน และ หลักสูตร',
          questions: [
            {
              id: uuidv4(),
              questionHtml: 'อยากทราบว่า level 1, 2 และ 3 ค่าใช้จ่ายเท่ากันไหมครับ',
              answerHtml: 'ค่าใช้จ่ายเหมาทั้งคอร์สคือ 110,000 บาท ต่อหัว สำหรับพนักงาน GC Group ทางบริษัท GC รับผิดชอบค่าใช้จ่ายหลักสูตรให้'
            },
            {
              id: uuidv4(),
              questionHtml: 'What will be criteria for selecting project/proposal?',
              answerHtml: 'พิจารณาจาก 1) Impact หรือผลกระทบที่น่าจะได้รับ เช่น ผลกำไร ความพึงพอใจของลูกค้า เป็นต้น  2) ความเป็นไปได้ที่จะดำเนินการภายในระยะเวลาที่กำหนด (เสร็จทันภายในหลักสูตร) 3) มีแหล่งข้อมูลและข้อมูลเพียงพอ รวมถึงความเหมาะสมของการใช้เงินทุนและกำลังคนในการดำเนินโครงการ'
            },
            {
              id: uuidv4(),
              questionHtml: 'เรียนกี่ชั่วโมงต่อหนึ่งครั้งหนึ่ง',
              answerHtml: 'Intensive Class ไม่เกินวันละ 8 ชม. และไม่เกิน 2 วันต่อครั้ง'
            },
            {
              id: uuidv4(),
              questionHtml: 'Project ที่จะนำไป Study ในคอร์สจำเป็นต้องจบพร้อมคอร์สเรียนไหมครับ Follow Up ยังไงครับ',
              answerHtml: 'การทำโครงการ (project) จะต้องจบภายในหลักสูตร โดยที่หัวหน้างาน จะเป็นผู้ประเมินโครงการ'
            },
            {
              id: uuidv4(),
              questionHtml: 'จะมีการจัดการอบรบต่อเนื่องหลังปี 2020 หรือไม่ อย่างไร',
              answerHtml: 'ทาง GC คาดหวังว่าจะเปิดหลักสูตรในระดับความรู้ที่สูงขึ้นไปคือระดับ Mid Level ให้กับผู้ที่ผ่านการเรียนในหลักสูตร Entry Level แล้ว'
            },
            {
              id: uuidv4(),
              questionHtml: 'หากประเมินผลเเล้ว จะได้เข้า Class Level 1.1 จะต้องเรียน 1.2 1.3  ต่อเนื่องเลยใช่หรือไม่ครับ',
              answerHtml: 'ใช่ เรียนต่อเนื่องจนจบ Level 1.3'
            },
            {
              id: uuidv4(),
              questionHtml: 'คนนึงสามารถเข้าเรียนได้ทั้ง 3 Course ไหมครับ หรือได้แค่ 1 Course',
              answerHtml: 'สามารถเข้าเรียนได้ทั้ง 3 Level โดยจะมีการทดสอบก่อนเรียนเพื่อแบ่งระดับความรู้เริ่มต้นของผู้เรียนออกเป็น 3 กลุ่ม ได้แก่ Level 1.1 Level 1.2 และ Level 1.3 โดย Level 1.1 จะเริ่มเรียนในเดือน พ.ค-ก.ค Level 1.2 เริ่มเรียนในเดือน ส.ค-ต.ค และ Level 1.3 จะเรียนในเดือน ต.ค-ธ.ค'
            },
            {
              id: uuidv4(),
              questionHtml: 'License Software ที่ต้องใช้ มีอะไรบ้าง ค่าใช้จ่ายประมาณเท่าไหร่',
              answerHtml: 'Software ที่ใช้หลักๆ จะมี Python ซึ่งเป็น Freeware ไม่มีค่าใช้จ่าย และ software อื่นๆ ที่อาจจะต้องใช้ เช่น Tableau, Excel, และ Power BI'
            },
            {
              id: uuidv4(),
              questionHtml: 'Classroom จะเรียนในช่วงวันธรรมดาหรือว่าเสาร์อาทิตย์',
              answerHtml: 'เรียนวันธรรมดา ในเวลาราชการ'
            },
            {
              id: uuidv4(),
              questionHtml: 'Track ทั้ง 4 Track มีจำกัดจำนวนคนเรียนหรือไม่ครับ ในกรณีคนสนใจ Track เดียวกันเป็นจำนวนมาก',
              answerHtml: 'ไม่ได้จำกัดจำนวน แต่อาจจะแบ่งเป็น Section 1, 2 โดยเรียนไม่พร้อมกัน เพื่อให้การเรียนการสอนเป็นไปอย่างทั่วถึง'
            },
            {
              id: uuidv4(),
              questionHtml: 'จะมีอาจารย์หรือ ผู้ช่วยตอบคำถามสำหรับพนักงานที่เรียนผ่าน Conferences ที่ Enco หรือไม่คะ',
              answerHtml: 'ไม่มี'
            },
            {
              id: uuidv4(),
              questionHtml: '100 คนนี่ เรียนพร้อมกันเลยใช่ไหม อาจารย์มีเวลาให้ปรึกษานอกเวลาไหม',
              answerHtml: 'จะแบ่งผู้เข้าเรียนตามระดับความรู้เป็น Level 1.1, 1.2, 1.3 โดย Level 1.1 จะเริ่มเรียนในเดือน พ.ค-ก.ค Level 1.2 เริ่มเรียนในเดือน ส.ค-ต.ค และ Level 1.3 จะเรียนในเดือน ต.ค-ธ.ค ซึ่งเบื้องต้นในแต่ละ Level จะมีการแยกผู้เรียนออกเป็น 2 กลุ่ม เพื่อให้การเรียนการสอนเป็นไปอย่างทั่วถึงและมีประสิทธิภาพ และมีการจัด Office Hours เพื่อให้ซักถามอาจารย์เพิ่มเติม'
            }
          ]
        },
        {
          id: uuidv4(),
          headingHtml: 'หมวดคำถามเกี่ยวกับการสมัครเข้าเรียน',
          questions: [
            {
              id: uuidv4(),
              questionHtml: 'ถ้า Plant มี T/A อยู่สองเดือน ทำให้ไม่สามารถเข้าเรียนได้ครบทุกช่วง จะสามารถสมัครได้ไหมครับ',
              answerHtml: 'สมัครเรียนได้ ซึ่งเกณฑ์การประเมินผลการเรียนเรื่องหนึ่งคือ ผู้เรียนจะต้องเข้าเรียนไม่น้อยกว่า 80% ของคลาสเรียนทั้งหมด หากมีความจำเป็นฉุกเฉินไม่สามารถเข้าเรียนได้ จะต้องแจ้งเหตุผล และทางทีมงานจะพิจารณาตามความเหมาะสมต่อไป'
            },
            {
              id: uuidv4(),
              questionHtml: 'ถ้าพนักงานสมัครแล้ว "ไม่ผ่านการคัดเลือก" น่าจะส่งผลในแง่ลบในสายตาผู้บริหาร ดังนั้น จึงอยากทราบเกณฑ์การคัดเลือกด้วยครับ',
              answerHtml: 'เนื่องจากทาง GC และ VISTEC คำนึงถึงประสิทธิภาพสูงสุดของการเรียนการสอน ดังนั้นจึงจำเป็นต้องจำกัดจำนวนผู้เรียนให้สอดคล้องกับจำนวนอาจารย์ผู้สอน สถานที่เรียน และทรัพยากรอื่นๆ ที่จำเป็นต่อการเรียนรู้ เพื่อคุณภาพการเรียนการสอนที่ดีที่สุด ซึ่งผู้บริหารของบริษัทในกลุ่ม GC มีความเข้าใจถึงข้อจำกัดเหล่านี้ ทางคณะทำงานจึงต้องคัดเลือกกลุ่มคนที่จำเป็นนำความรู้ด้าน Data Science ไปใช้ในการทำงานมาเรียนก่อน โดยได้กำหนดเกณฑ์การพิจารณาผู้สมัครดังนี้ 1) Project Idea ที่มี Impact หรือผลกระทบที่น่าจะได้รับ เช่น ผลกำไร ความพึงพอใจของลูกค้า เป็นต้น, ความเป็นไปได้ที่จะดำเนินการภายในระยะเวลาที่กำหนด (เสร็จทันภายในหลักสูตร) และมีแหล่งข้อมูลและข้อมูลเพียงพอ รวมถึงความเหมาะสมของการใช้เงินทุนและกำลังคนในการดำเนินโครงการ 2) ความสามารถในการเข้าเรียนให้ครบตามกำหนด 3) ความจำเป็น และความเร่งด่วนที่ต้องนำความรู้ไปใช้ในการทำงาน ทั้งนี้หากพนักงานมีความสนใจหรือต้องการเรียนในหลักสูตรนี้จำนวนมาก อาจมีการพิจารณาขยายหลักสูตรเพิ่มเติม หรือเปิดรอบเพิ่มเติมในอนาคต'
            },
            {
              id: uuidv4(),
              questionHtml: 'ในกรณีที่ทำงานทางด้าน Data Engineering อยู่แล้ว เหมาะสมที่จะเรียนคอร์สนี้หรือไม่',
              answerHtml: 'นอกเหนือจากการเรียนการสอน ผู้เรียนยังได้ทดลองทำ Project ที่สนใจด้วย จึงเป็นประโยชน์ต่อผู้ที่ทำงานทางด้าน Data Science นอกจากนี้ ผู้ที่ทำงานด้านนี้อาจจะเลือกเรียนเพิ่มเติมในสาขาที่ตนยังไม่เชี่ยวชาญ เช่นผู้ที่เชี่ยวชาญด้าน Modeling อาจจะเลือกมาเรียนในส่วนของ Data Engineering เพิ่มเติม'
            },
            {
              id: uuidv4(),
              questionHtml: 'โครงการ Data Science สามารถตอบโจทย์ให้กับผู้ที่มีความรู้ด้าน คณิตศาสตร์ สถิติ แต่อาจจะไม่ได้มีความเชี่ยวชาญด้าน Program หรือไม่',
              answerHtml: 'ได้ เพราะเนื้อหาของหลักสูตรจะครอบคลุมทุกสาขาวิชาที่กล่าวมา'
            },
            {
              id: uuidv4(),
              questionHtml: 'ถ้าไม่มีพื้นฐาน Data Science เลย ควรเตรียมตัวอย่างไร',
              answerHtml: 'คอร์สนี้เป็นการปูพื้นฐานเบื้องต้น จึงเหมาะกับผู้ที่ไม่มีพื้นฐาน หากผู้เรียนต้องการที่จะเตรียมตัวล่วงหน้า ให้ลองศึกษาภาพรวมของ Data Science เพื่อหาไอเดียในการทำ Project'
            },
            {
              id: uuidv4(),
              questionHtml: 'หน่วยงานต้นสังกัดคงยังไม่ได้มีการตั้งงบประมาณสำหรับ Additional Software หากต้องการใช้งานเพิ่มเติม​ (ถ้ามี)​ ทาง​หน่วยงาน Digital Transformation น่าจะเหมารวมไปเลยสำหรับ​พนักงาน​ GC นะครับสำหรับ​โปรเจคนี้',
              answerHtml: 'เบื้องต้นจะมีการเตรียม Software ที่จำเป็นต่อการเรียนให้อยู่แล้ว แต่ในการเรียน Level 1.3 ที่แต่ละคนจะเลือกเรียนในสาขาที่สนใจ และสามารถเลือกใช้ Tools ที่สนใจได้  ซึ่ง Tools บางอย่างจะเป็น Freeware อยู่แล้วเช่น Python แต่บางอย่างอาจจะมีค่าใช้จ่ายเพิ่มเติม เช่น SAS Tableau เป็นต้น โดยทาง GC จะเตรียม Bundle Package ให้ แต่ทางต้นสังกัดของผู้เรียนจำเป็นต้องรับผิดชอบค่าใช้จ่ายเพิ่มเติมในส่วนนี้'
            },
            {
              id: uuidv4(),
              questionHtml: 'หลักสูตรจะเริ่มตั้งแต่เอาข้อมูลของเรา มาจัดหมวดหมู่ให้เป็นระบบ (Data Engineering) เลยใช่ไหมค่ะ แล้วจำกัดไหมว่าต้องเยอะขนาดไหน',
              answerHtml: 'ผู้เรียนจะได้เรียนรู้สิ่งที่จำเป็น เพื่อสามารถนำไปประยุกต์ในการจัดหมวดหมู่ข้อมูลได้ด้วยตัวเอง โดยในขั้นต้นไม่มีการจำกัดขนาดของข้อมูล'
            },
            {
              id: uuidv4(),
              questionHtml: 'ถ้าไม่ได้สมัคร สามารถเปิดให้เข้าร่วม Class ได้มั้ยครับ เป็น Observers',
              answerHtml: 'สามารถเข้ามาชมวิดีโอย้อนหลังได้ในเว็บไซต์หลักสูตร'
            },
            {
              id: uuidv4(),
              questionHtml: '1-page Project Proposal มี Template หรือไม่ และ Criteria ในการตัดสิน Proposal มีอะไรบ้างครับ',
              answerHtml: 'ไม่มีเทมเพลต แต่จะมีการให้ Guideline หัวข้อ และ Criteria ในการตัดสินจะประกอบด้วย Impact ที่โครงการจะมี โดยพิจารณาความเป็นไปได้ในการทำโครงการนี้ให้เสร็จภายในระยะเวลาที่กำหนดประกอบค่ะ'
            },
            {
              id: uuidv4(),
              questionHtml: 'Criteria ในการคัดเลือกคนเข้าเรียน ดูจาก Proposal ที่ส่งมา เป็นหลักใช่ไหมคะ',
              answerHtml: 'ดูจาก Proposal รวมถึงการตอบคำถามอื่นๆ ในใบสมัครประกอบกันค่ะ'
            },
            {
              id: uuidv4(),
              questionHtml: 'ในแต่ละหน่วยงาน สามารถส่งเข้าร่วมโครงการได้มากกว่า 1 เรื่องหรือไม่',
              answerHtml: 'ใช่ค่ะ ผู้สมัครแต่ละท่านจะต้องส่ง Proposal ของตนเอง'
            },
            {
              id: uuidv4(),
              questionHtml: 'Project ที่ทำ สามารถมาจากไอเดียที่คิดว่า อยากทำ โดยอาจจะยังไม่มีข้อมูลได้หรือไม่',
              answerHtml: 'ได้ค่ะ แต่จะต้องมีวิธีที่จะเก็บ หรือได้มาซึ่งข้อมูลด้วย'
            },
            {
              id: uuidv4(),
              questionHtml: 'หากผ่านการคัดเลือก Proposal ที่สมัคร จะสามารถใช้เป็น Project ที่ใช้ในหลักสูตรด้วยได้เลยมั้ยคะ?  เพื่อให้เกิดประโยชน์สูงสุดต่อหน้างานตนเอง (หรือจะต้องคิด Project ใหม่กับหลุ่มที่เรียนด้วยกันคะ?)',
              answerHtml: 'Proposal ที่ใช้สมัครทื่ผ่านการคัดเลือก (ไม่เกิน ​30 เรื่อง) จะถูกนำไปใช้จริงในหลักสูตรค่ะ'
            },
            {
              id: uuidv4(),
              questionHtml: 'คอร์สนี้จะต้องจับกลุ่มทำ Project หรือไม่ หรือว่าทำเดี่ยว คือตอนนี้ไม่มีเคสอาจจะเข้าเรียนแล้วช่วยทำเคสให้เพื่อนในกลุ่มได้',
              answerHtml: 'Project จะทำกันเป็นกลุ่ม แต่ผู้สมัครทุกคนต้องส่ง Proposal ของตนเองมาพร้อมใบสมัครเข้าร่วมโครงการค่ะ'
            },
            {
              id: uuidv4(),
              questionHtml: 'Proposal ต้องส่งตอนสมัครใช่ไหมคะ แล้วระหว่างทางการ Develop Project จะมี Milestone อย่างไร ผ่าน Clinic?',
              answerHtml: 'Milestone จะพัฒนาตามความรู้ที่เรียนในแต่ละ Level เช่น Level 1.1 จะเรียนการวิเคราะห์ข้อมูลเบื้องต้น Project ใน Level นี้ ก็จะต้องนำเสนอการวิเคราะห์ข้อมูลตามที่เรียนมาค่ะ'
            },
            {
              id: uuidv4(),
              questionHtml: 'รบกวนช่วยแนะนำลักษณะ หรือตัวอย่าง ของ Use Case (Project) ที่เหมาะสมเพิ่มเติมครับ เช่น ต้องมี Data ระดับไหน หรือต้องใช้วิธีการ หรือความยากในการ Process ระดับไหนเพื่อแก้ปัญหา และจะทราบได้อย่างไร ว่าเป็นปัญหาที่การเรียน Course นี้ สามารถช่วยให้แก้ปัญหาได้ตรงจุดขึ้น คาดว่าน่าจะช่วยให้ Propose ได้ง่ายขึ้นครับ',
              answerHtml: 'ข้อมูลควรเป็น Structured Data ที่มีขนาดไม่เล็กจนเกินไป (เช่น มีมากกว่า 500 Observations) แต่ก็ไม่ควรจะใหญ่เกินไป การเรียนใน Course นี้ จะปูพื้นฐานในภาพรวมให้ อาจจะไม่สามารถทำให้แก้ปัญหาได้ทุกโจทย์ แต่ก็จะเพียงพอให้ผู้เรียนไปต่อยอด เช่นไปศึกษาเพิ่มเติมด้วยตนเองได้'
            },
            {
              id: uuidv4(),
              questionHtml: 'ในการเรียน สามารถทำ Co-project Assessment ได้หรือไม่ เพราะบาง Project อาจจะต้องใช้ทั้ง Data Engineering, Data Scentist, Domain Expert, … หรืออาจจะเป็นการร่วมมือระหว่างหน่วยงาน',
              answerHtml: 'Project เป็นงานกลุ่มที่จะต้องทำร่วมกันอยู่แล้วค่ะ โดยการจัดกลุ่มจะพยายามให้มีผู้เชี่ยวชาญในสาขาที่แตกต่างกัน'
            },
            {
              id: uuidv4(),
              questionHtml: 'ถ้าโปรเจคที่เราเสนอไป ไม่ได้ไปต่อ เราสามารถเลือกไปอยู่กลุ่มอื่น ที่ทำโปรเจคที่เราสนใจ แต่ไม่เกี่ยวกับหน่วยงานที่เราทำงานอยู่ ได้หรือไม่',
              answerHtml: 'ได้ค่ะ'
            }
          ]
        },
        {
          id: uuidv4(),
          headingHtml: 'หมวดคำถามเกี่ยวกับการเตรียมตัว',
          questions: [
            {
              id: uuidv4(),
              questionHtml: 'ค่าใช้จ่าย 110,000 ต่อ Level หรือ All Level',
              answerHtml: 'ค่าใช้จ่ายเหมาทั้งคอร์สคือ 110,000 บาท ต่อหัว สำหรับพนักงาน GC Group ทางบริษัท GC รับผิดชอบค่าใช้จ่ายหลักสูตรให้'
            },
            {
              id: uuidv4(),
              questionHtml: 'อยากทราบ Tools ที่ใช้ในการเรียนการสอน เช่น Analytics Tools ว่าใช้เป็น พวก Python หรือ Software ที่มี ลิขสิทธิ์ เช่น SAS',
              answerHtml: 'Tools ส่วนใหญ่ในหลักสูตรนี้จะเป็น Open Source Tools แต่จะมี Software บางส่วนซึ่งต้องมีค่าลิขสิทธิ์ เช่น SAS และ Tableau ซึ่งผู้เรียนสามารถเลือกใช้ Software ที่ใกล้เคียงกันอย่างอื่นได้ (แต่ทางผู้สอนอาจจะไม่สามารถช่วย Troubleshoot ได้)'
            }
          ]
        }
      ]
    }
  }
}
</script>


<style scoped>
  .modal h4 {
    margin-top: 1.25rem;
  }
</style>
